Tutorial/4.CounterFlowFlame.FTM/Allprepare.FTM
#!/bin/sh
cd "${0%/*}" || exit 1

. "$WM_PROJECT_DIR/bin/tools/RunFunctions"

properties="constant/physicalProperties"
originalProperties="constant/physicalProperties.ori"

if [ ! -f "$originalProperties" ]
then
    echo "Error: $originalProperties does not exist."
    exit 1
fi

# Start from the original DTM configuration
cp "$originalProperties" "$properties"

runApplication -o DTMchemkinToFoam \
    chemkin/chem.inp \
    chemkin/therm.dat \
    chemkin/tran.dat \
    chemkin/transportSutherland \
    constant/reactions \
    constant/thermo.DTM

runApplication -o blockMesh

# Activate the FTM preprocessing configuration
sed -i \
    -e '/^[[:space:]]*usingPreProcessingFTM[[:space:]]/s/false/true/' \
    -e '/^[[:space:]]*transport[[:space:]]/s/DTMTransport/preprocessingFTMTransport/' \
    "$properties"

rm -f constant/thermo.FTM
runApplication -o FTMchemkinToFoam

if [ ! -f constant/thermo.FTM ]
then
    cp "$originalProperties" "$properties"
    echo "Error: constant/thermo.FTM was not generated."
    exit 1
fi

# Restore the original DTM configuration
cp "$originalProperties" "$properties"

echo "Generated constant/thermo.FTM successfully."

#------------------------------------------------------------------------------
